# ====================================================
# ======================= 杂项 =======================
# ====================================================
# 使用 python 替代 python3
alias python="python3"

# 用 nvim 作为默认编辑器
alias vim="nvim"
alias vi="nvim"

# ====================================================
# ==================== ls 美化配置 ====================
# ====================================================
# ls 的颜色输出
if [[ "$(uname)" == "Darwin" ]]; then
    alias ls="ls -G"
else
    alias ls="ls --color=auto"
fi

# 更详细的 ls 输出
alias ll="ls -alhF"


# ====================================================
# ==================== 全局别名配置 ====================
# ====================================================
alias -g NE="2>/dev/null"       # 丢弃错误
alias -g NO=">/dev/null"        # 丢弃输出
alias -g NA=">/dev/null 2>&1"   # 全部丢弃


# ====================================================
# ==================== 文件后缀关联 ====================
# ====================================================
# 媒体文件直接打开
for ext in mov png mp4; do
    alias -s $ext="open"
done

# 代码用 vscode
for ext in md py json yaml; do
    alias -s $ext="code"
done


# ====================================================
# ================== conda 懒加载代理 ==================
# ====================================================
conda() {
    unfunction conda
    source "$HOME/.config/zsh/conda.zsh"
    conda "$@"
}

# ====================================================
# =================== yazi 自动 cd ===================
# ====================================================
y() {
	local tmp="$(mktemp -t "yazi-cwd.XXXXXX")" cwd
	command yazi "$@" --cwd-file="$tmp"
	IFS= read -r -d '' cwd < "$tmp"
	[ "$cwd" != "$PWD" ] && [ -d "$cwd" ] && builtin cd -- "$cwd"
	rm -f -- "$tmp"
}
